# WPerMK Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..WPerMK Property
SymbolTypeId Class See Also
---
Symbol W/(m·K), indicating unit Watts per meter kelvin.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId WPerMK { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WPerMK As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WPerMK {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace